johnmholmes/Arduino_ESP32_LCC_Journey/Examples/ESP32/Can/Gen3_2_Servo24IO/boards.h

// Board definitions
// Add a new variant by copying the appropriate section and changing the pin definitions, etc. 

#include "Config.h"

#if defined(NANO_BOARD)
  #ifndef ARDUINO_ARCH_AVR
    #error Choose the Nano
  #endif
  #define BOARD "Nano"
  //#define NUM_SERVOS 2
  #define SERVOPINS     A4,A5
  #define NUM_NATIVE_IO 11
  #define IOPINS        13,4,5,6,7,8,9,A0,A1,A2,A3
  #define NUM_IO        27    // calcualte by hand = 11+16
  #ifndef USEGCSERIAL
    #define MCP2515_CS  = 10 ; 
    #define MCP2515_INT =  3 ;
    #define CAN_TX_PIN 99
    #define CAN_RX_PIN 99
    #include <ACAN2515.h>
  #endif // USEGCSERIAL
  #include <Servo.h>
  #define EEPROMbegin 
  #define EEPROMcommit 
  #define WIRE_begin 


#elif defined(ESP32_BOARD)
  #define BOARD "ESP32"
  #define SERVOPINS     32, 33
  #define NUM_NATIVE_IO  8
  #define IOPINS        16,17,18,19,14,27,26,25
  #define NUM_IO        24    // calcualte by hand = 8+16
  #define CAN_TX_PIN (gpio_num_t) 2
  #define CAN_RX_PIN (gpio_num_t) 15
  #ifndef USEGCSERIAL
    #include "ACAN_ESP32Can.h"
  #endif // USEGCSERIAL
  #include <ESP32Servo.h>
  #define EEPROMSIZE 4096
  #define EEPROMbegin if(!EEPROM.begin(EEPROMSIZE )) { Serial.println("Failed to initialize EEPROM"); }
  #define EEPROMcommit EEPROM.commit();
  #define WIRE_begin Wire.begin(21, 22, 100000)


#elif defined(ESP32_BOARD_ALT)
  #define BOARD "ESP32"
  #define SERVOPINS     32, 33
  #define NUM_NATIVE_IO  8
  #define IOPINS        16,17,18,19,14,27,26,25
  #define NUM_IO        24    // calcualte by hand = 8+16
  #define CAN_TX_PIN (gpio_num_t) 5
  #define CAN_RX_PIN (gpio_num_t) 4
  #ifndef USEGCSERIAL
    #include "ACAN_ESP32Can.h"
  #endif // USEGCSERIAL
  #include <ESP32Servo.h>
  #define EEPROMSIZE 4096
  #define EEPROMbegin if(!EEPROM.begin(EEPROMSIZE )) { Serial.println("Failed to initialize EEPROM"); }
  #define EEPROMcommit EEPROM.commit();
  #define WIRE_begin Wire.begin(21, 22, 100000)


#elif defined(ATOM_BOARD)
  #define BOARD "Atom"
  //#define NUM_SERVOS 2
  #define SERVOPINS     25,21
  #define NUM_NATIVE_IO 2
  #define IOPINS        22,19
  #define NUM_IO        18    // calcualte by hand = 2+16
  #define CAN_TX_PIN    (gpio_num_t)26
  #define CAN_RX_PIN    (gpio_num_t)32
  #ifndef USEGCSERIAL
    #include "ACAN_ESP32Can.h"
  #endif // USEGCSERIAL
  #include <ESP32Servo.h>
  #define EEPROMSIZE 4096
  #define EEPROMbegin EEPROM.begin(1000);
  //#define EEPROMbegin { dP("\n size of memstruct="); dP(sizeof(MemStruct)); if(!EEPROM.begin(sizeof(MemStruct)+100)) { Serial.println("Failed to initialize EEPROM"); }
  #define EEPROMcommit { EEPROM.commit(); dP("EEPROM COMMIT"); }
  #define WIRE_begin Wire.begin(23, 33, 100000)  // choose pins for I2C

#elif defined(ATOM_BOARD_WITH_BASE)
  #define BOARD "Atom"
  //#define NUM_SERVOS 2
  #define SERVOPINS     23,33
  #define NUM_NATIVE_IO 1
  #define IOPINS        39 // button
  #define NUM_IO        17    // calcualte by hand = 1+16
  #define CAN_TX_PIN    (gpio_num_t)19
  #define CAN_RX_PIN    (gpio_num_t)22
  #ifndef USEGCSERIAL
    #include "ACAN_ESP32Can.h"
  #endif // USEGCSERIAL
  #include <ESP32Servo.h>
  #define EEPROMSIZE 4096
  #define EEPROMbegin EEPROM.begin(1000);
  //#define EEPROMbegin { dP("\n size of memstruct="); dP(sizeof(MemStruct)); if(!EEPROM.begin(sizeof(MemStruct)+100)) { Serial.println("Failed to initialize EEPROM"); }
  #define EEPROMcommit { EEPROM.commit(); dP("EEPROM COMMIT"); }
  #define WIRE_begin Wire.begin(26, 32, 100000)  // choose pins for I2C



#elif defined(MINIMA_BOARD)
  #define BOARD "Minima"
  //#define NUM_SERVOS 2
  #define SERVOPINS     2,3
  #define NUM_NATIVE_IO 8
  #define IOPINS        6,7,8,9,10,11,12,13
  #define NUM_IO        24    // calculate by hand = 8+16
  #define CAN_TX_PIN 4
  #define CAN_RX_PIN 5
  #ifndef USEGCSERIAL
    #include "R4.h"
  #endif // USEGCSERIAL
  #include <Servo.h>
  #define EEPROMbegin 
  #define EEPROMcommit 
  #define WIRE_begin 


#else
  #error "No board selected"

#endif
